characters = {
//`~!@#$%^&*()-_=+[]{}\|;:'"/?,.<>
"a":[..."ªÀÁÂÃÄÅÆάАàáâã⍶⎀⎁ᶏᶐᵃᶛᵄᵅᵆ⎂⍺ᴀᴁᴂ⟁Å⟠v₳ᶺåæѪĀᴬᴭᴧ⏶☙Ӑₐ＠∧⏫∀⍲ₔ‣⸫≜⏏⍙⏃⏄⏅≙⋏＾⍍☕⌤⍋⋀∆∇⟑￪ӒӔ⅄ﾑāのԬԮ✡⟎ĂѬă⚻ĄąѦ⟏⁂Ѩ⛠⁖⛡⛛‸Д⛢Ǎ⛰⛵⛺⛤⛥⛬⛼⛦⛧⛍⚝ǎǝǞǟ⊿⚠△▷▽◁ǠǡǢǣǺǻǼǽȀȁȂȃȦȧԈ߷ȺɅӅɐɑɒɘəɚΆΑΔΛϪ"].concat(["a","4","e","o","0","3","@","<>","/-\\","/\\","$","u"]),
"b":[..."ÞßþƀƁҔՅ₿ƂƃᵬҌƄᶀᵦեѢᵝѣᵷ␢ℬƅ〖ᵇ〗ᴃ⛄【】℔ЬӸ∂ᴮᴯり♭♮♇⋈☍ЪЫƥȸ⛇☃ȹɃɓБВϷʖʙΒϐϦЉ‰‱⁒％＆"].concat(["b","8","|o","/o","\\o","%","|c","d","*","|>","|3","3","[3"]),
"c":[..."¢©ÇçᶗĆćĈԸ₡₢⟈⟉⍧ᶜᶝℂᴝᴞᵙ🄫【ᵓᴐᴒ】∁˒˓⟬ᴄ⟭⋲⋳⋴⋵⏾⋶⋷⋸⋹⋺⋻⋼ﬤ⋽⋾⋢⋣⋤⋥⊏⋐⋑⊐⊑⊒￠✆ﾧ❲בּגּ❳❴❵⊂כּ⊃⊄נּ⊅⊆⊇⊈⊉⊊⊋〔〕⸦⸧⸨⸩っつづ〖〗〘〙〚〛℃｛｝∈∉∊∋∌∍℄℅ℭ℆ĉ⟃（）｟｠［］₾₵⟄Ċ❨❩❪❫ℶ⟦⟧ℷċ₲☪ҪϽϾС⚳Ͽ€₠☭☽☾ϹҨ⁽⁾₍₎⚸Ҁ⁌⁍ѤČ⁅⁆čↃↄↅƆⅭⅽƇƈȻȼɁɂɔɕʗͻͼͽϠϲ🅮"].concat(["c","(",")","[","]","{","}","<",">"]),
"d":[..."ÐðòóĎďĐđƉԀԂƊᶑᵹдᶁᶞƋ🆥ᵭƌƍ◖◗ᵟ◐◑ᵈ⟬〆ᴅᴆ⟭⟮⟯ⅅⅆ◊∂◿₫ᴰƿ♩ǷԺȡ⋻⋼⋳⋴ȸ₯ȹɖɗ⁌⁍ʠΔⅮↀ☃ↁↂⅾδϷↇↈ"].concat(["d","o|","o]","o}","o)","6","9","|)","(|","[)","(]","1)","l)","i)","(1","(l","(i","o","0","b","o/","\\o","|>","|.","|,","c|","cl","ci","oi","ol","c]","c)","c}"]),
"e":[..."£ÈÉÊËèéêԄԆℇ℈⋿ᶒᶓᶔᶕ∈⍷∉ᵫ∊∋∌∍ᴟᶟ⅀￡ᵉᵊᵋᵌⅇ∑ëᴔĒᴇ❴∃∄❵℮ℯᴱᴲℰӞﾼₔӠ₠έ☙｛｝☕ѤₑҘの€₤↋ԐЭӖ‡‣ӘӚҼҾēЕĔ⁅⁆ԘӬѮЗĕĖЄЀЁξϵėĘęĚěƎѐёƏ϶ƐƩƷƸƹƺǝǮǯȄȅȆȇȜȝȨȩɆɇɐɘəɚɛɜɝɞʚͰͱΈ♯ΕΣϠ"].concat(["e","3","{","}","[-","-]","#","(-","-)","{-","-}","a","o"]),
"f":[..."£ſƑƒԄⅎҒƭᵵԲʃₜᵲᶴᵳ˧ᶋᶂᶠᶡᶘ￡֏ᵮﾓ⎰⎱˫❡Ӻʄℐｦ⸶⸷ℑ⋕∫7∬∭∮∯∰∱∲⊢⊣⊧⊨⊫⊭⊯∳𝟊𝟋ℒ₮ℱℲ₣⚿₰℉ʅ₹ʆԴͰͱ₤ΓϜϝԆ†‡├┝┞┟┠┡┢┣┤┥┦┧┨┩┪┫╞╟╠╡╢╣"].concat(["f","t","|=","/=","\\=","=/","=\\","ph"]),
"g":[..."ĜĝĞğĠġĢ⅁℄ģℭƍᵷƓℊᵹᶃǤℐℑᶢᴳℒǥǦ₲Ԍ₠ǧǴᵍǵɠɡɢʛ☃ϑϬϱ"].concat(["g","9","6","y","&","q","p","o/","o\\","o|","c","(","(.","(,","('","[","[.","[,","['","{","{.","{,","{'"]),
"h":[..."ĤĥĦħƕǶ⛕ԊԦԨ⑁🈂ᵸҢҤₕℋℌᴴℍᶣℎℏҦ⚗ￃ⍾ￅȞんゟҺ♄♅ԠԢНȟ♓ӇӉҊɥЂɦИЙɧʜ⛩ђʮʯʰʱͰͱЊЋΉΗΠ"].concat(["h","n","|n","|-|","i-i","l-l","l-i","i-l","}{","][",")(","]-[","!-!"]),
"i":[..."ÌÍÎÏìíîίïĨᵢ⑄ᶖĩ𝚤⍳ː𝚥℩ᵻᵼ˸ᶤᶥᶦᶧᴉᴵ⎎₶ⅈĪℹ⍸ⁱᵎ⟊：⌶；ｪī҂Ю❢❣⸘⸙ℐℑℒℓĬĭѤĮӀⅠⅡ☝☥♿⚲⚳☨☦ⅵ:;⁏♊⛹☤ⅶtⅷⅨⅪⅫⅸⅺⅻ⛷✍ⅢⅰⅱⅥⅦⅧⅲⅣⅳįІѨЇİıĲĳƖϊѬƗǏǐȈȉȊȋɨΪɩɪɸΊΐΙ🅯"].concat(["i","1","|","l","/","\\","j","!","a","e"]),
"j":[..."ĲĳĴĵƾǰȷϳɈᴶɉЈɟʝʲⅉͿ⌡ᶨᴊᶡ₶"].concat(["j","g","t"]),
"k":[..."ĶķĸƘҚҜҞԪҞKᴷƙӃǨǩЌԞᶄ₭Кᴋʞ⟀ΚϞϏЖxᵏ⚷✀✁✂✃✄ₖ⚿"].concat(["k","|<",">|","i<",">i","l<",">l","1<",">1","|{","}|"]),
"l":[..."¬ĹĺĻļԸԼ℄Հ⎲ᴸ⎳Ľ┌┍┎┏ᶴ˾ᶘᶩᶪᶫᶋᶅ⎣ᴌᴦ⏗˻˼⎦◞◟⌙⎿し⏌⍼じ∟￢┐┑┒⌐「ﬧ⸀⸁⸢⸣⌜ﬢ⌝⌞⌟⸤⸥⌈⌉⌊⌋⌌⌍⌎⌏」『ヿ』וּזּ┓ﾤ⅂｢｣└┕┖⣇⣆┗┘▙▟▛▜┙┚┛╒╓╔╕╖╗╘╙╚╛╜╝╭╮╯╰ⅎ⟓⟔⅃ľ⅊ℸ⟂Ⅎ⟌Ŀ℔ւŀլנ⟀⚼ЃŁ⚶₺₶Гłƚ⛸ƪǇₗǈⅬ☇☈⁑ⅼ⛖⛗ǉȴȶȽɫ⛓ɬιɭɮʟ⚕ˡ˥˦˧˨˩˪˫Γ♩♫♬⁄"].concat(["l","|_","l_","i_","[_","[","]","/_","\\_","/","\\","]_","_|","_l","_i","_]","_[","_/","_\\"]),
"m":[..."µƜɯɰɱϺᴹ⚗ϻᴟᶬᶭ⛲₥ʍМӍℕᵯᶆ≞ℳᵚ⅏ᴍ⏞№♒₼ᵐ〽ԠₘₙΩ℧⛩ΜԔΨ⚖ѪѬⅯ☝⛫ⅿ♍♏"].concat(["m","n","/\\/\\","w","\\/\\/","|\\/|","|\\/\\","/\\/|","i\\/i","l\\/l","i\\/l","l\\/i","uu","^^","rrr","rn","rr|"]),
"n":[..."µÑñŃҦńŅᴺᴻᵰԤᴫ⍝⛲ℵ◚◠˰⑃ᶇᴒᴖ∧ᶺᵔᴧᶮᶯᶰᴨ⌢⏠ᴎոᵑ⏜⏞∩⌅⍾אַאָ⌒⌤⌓⌆ℕאּ⎍⌔ℼ⊓⋒⋔⌃№⋏₦ﬣ⋂ￗℿﬨ⊼₪⋀⌒∏ﬡ₼⹅⹆♑◠＾Ω￪℧∩ⁿへんべぺり⛩ₘₙ⋒⁔₶Ԡņ⁀Ոאה⛫☊☋חתӢ⚻ԮӤŇՌռИЛЙԒЍԈӅҊПňЉŉήŊŋƝƞǸǹȠȵɲϞɳɴʌ˄ˆͶͷΝΠϗϟϰ"].concat(["n","m","|\\|","|\\\\","|\\/","\\\\|","/\\|","/\\\\","|/|","|//","|//","////|","///|","///\\","i\\i","l\\l","i\\l","l\\i","i/i","l/l","i/l","l/i","rr","u","r.","r,","r|","ri","rl","^","/\\","|\\","/|","[\\|","|\\]"]),
"o":[..."¤©®°ºÒÓÔÕᴼᴽÖОØ〇ᵠᵨ⍬ᵟᶐםᵜ⚷ᶗ℺ᶿמᵹᶱᶲᴏᵷᵩᴐᴑᴒᴓᶞᴔᴕᵒᵓᵔᵕᴖᴗₒℭᴥ⊕⊖⊗⊘⊙⊚⍤˚⎌⍥˳⌻⌼⍎⏀⏁⏂⎄⌽ﬦ⎉⎊⎋⌾⍉⌱⍛⍜מּסּ⍟⍝⊛⊜⏺⏻🉐🉑🉠🉡🉢🉣🉤🉥⏼⊝ס⌭⌮⌚⏰⏱⏲⌕⌖✆⌓⌔✇ϴ⌀⅏⋅〆ﾟ𝡶≗∅⟃⟄∝∞ℴ≬∘∙⟠ﾷ〶〄〠のΩ℧∆∇⁐￮Ӧ☌✡➰＠➿₻｡❍✦✧✪őԾЮՓՕŒœƟƠơόƢѲƣǑǒǪǫǬϘФϙǭǾǿȌȍȎȏȢȣȪȫȬȭȮȯȰȱȸȹɊɋɞɵɶɷɸʘʚΌΏΘϑΟΦϕΩ℅☍⚝₢⛣•⚮⚯⚰⚱⚲Ө⁜⚘⚙Ӫ☿♀♁⁕♂⚛ðѸ♨☕♲⚆⚇⚈⚉♎♉Ѻ♺⚐⚑♻♼♽♾♿☥Ѽò⚢⚣⚤⚥⚦⚧⚨⚩☣☢ó☃♋♌օ☸☹☺☻☼□☯☄▭☉★☮✊✋✍☆ↂ▱○◊⋄☎☏ô֍ↀ☁ↈ֎õѠöøՉσŌōҨ۝۞۩ŎѾŏŐ߷Ϡ♠♡♢♣♤⚜⛄⚿⛀⛽⛇⛻⛆⛁⛂⛢⛃⚴⛤⛭⛮⛳⛴⛵⛯⛥⛦⛧♥♦⛈⛟♧☙⛅⚪⚫⛔⛑⛒⚬⚭⚽⚾"].concat(["o","0","q","u","a","e","()","[]","{}","<>","(]","[)","(}","{)","{]","[}","c)","( )","(_)","(=)","[ ]","[_]","[=]","{ }","{_}","{=}","@","<3","p","d","b"]),
"p":[..."¶ÞþƤƥƿǷȸᵱȹ⅊₻ᵽ❡℗ᵠᶗ🆊ᵨᵩ⅌ᶈᴾᴩᵖ⍴ᴘ℘ℙℼɁ₱ק₽բ♇ϼʔϷ⁋Ҏ∏☌☧ₚʡˀРΠΡϑϱ"].concat(["p","q","d","b","|o","o|","|c","c|","|0","|^","9","|'","|\"","|`","lo","io"]),
"q":[..."ƢƣǪǫǬǭȸȹɊդ℺❡ҀգᵠԚᵨᵩℚ☌фɋʕʠ☄ʢԳₚ☟ˁˤϑϱ"].concat(["q","p","d","b","o|","|o","c|","|c","0|","oj","cj","(j","<j","0j","ol","oi"]),
"r":[..."®ŔŕŖŗℾŘř◜ᵲᵳ◝˥₶⅊ᵣ｢┌ᴦ˦ᴿ˧ᶉᴙᴚ🄬⎲┍┎ﾡ┏┐˹˺⎡⎤⎧⏋7⎾⌌⌍⌐┑⌈⌉┒「┓╒ヿ『⌜⌝⌠⸎⸢⸣╓╔⸀⸁⸂⸃⸄⸅╕╖╗Ի▛▜⟔ℛ⟌ℜדּהּℝℭ℞℟ӺƦ☈ӶГȐЯҐ₢ЃȑȒȓɌɍɹɺɻɼɽɾɿʀʁʳʴʵʶ"].concat(["r","n","|(","|<","|f","|'","|`","|^","i^","l^","i(","l("]),
"s":[..."§ŚśŜŝςŞ☡şЅ⌇Š⑀ᴤ♌⎰ᵴ⎱Տₛᶳᶴ₴ᶊ🄪₷₰∾∿≀〄⸹⸈⸉⸊〻⛽♪š⚡⟅⟆ﬥ↊ふぶぷſ♃ƧζƨƾȘș＄ȿ⛷ʂʃʄʅʆϚϛˢϨ"].concat(["s","5","2","z","_\\-","-/_","~","$"]),
"t":[..."ŢţŤťԷŦ†ᵀⅎ‡ŧԵₜᵵᶵ⛲ᴛ⑄⍀ᶘ⋋ᵗπ∏⏁˔|ᶋ1!˕⏂⍕⍖⍎⍏⋌⏄⏅⏆⏇⏈﬩⏉⏊⍭⍡す⍊⌿ず₸₹Ⅎ⋕⟘⸶זּ⌶⊺⊻⊼⊽⊾⊿⸷⸸⹋⊢⊣⊤⊥⊦⊧⊨⊩⊪⊫⊬⊭⊮⊯〶ￓ⟙ナ⟂〸〹⸔⸕〺ﾋՇｲ⸆⸇ƫ〒ｨ〦〠├┝┞ﾓ┟┠┡ｫｬ┢┣┤┥┦┧┨┩┪┫╞╟╠╡╢╣┬┭┮┯┰┱┲┳┴┵┶┷┸┹┺┻╤╥╦╧╨╩₮₶✝✞✟☔ԎƬ♅Ђ⚘⛱⚳⁑⛏⛪⚴ƭ⛩⚸♄⚚⚿☤☥⚵☂҂☨☿♀♿♁♪♂†Ʈ☦♰♱ТƾЋȚ☩ҬțȶȾʇʈ☝ͲͳΤϮ"].concat(["t","7","+","f"]),
"u":[..."µÙÚÛÜЏӴùᵁúᴗᵤ⟒˽ﬠᴜᴝᶙᴞᵫᶶᶷᶸᶹᴟ⏘ᵚᵾᵿ⏟ᵘᵙ␣⏡◡ᵕ◛⍽⏝˘⊔ս⏑⏒⏓⏔⏕⏖Ω℧⍦⌣Ս⌰⋃∪⅌⌴∩⋓Կ☕טՄ⊌⊍⊎Ԅ⚓∐ûӋ⹆⹇⹈ⅵ⛎ひטּびぴⅶ⛀⁐⛁⛂⛃ⅷ☊☋〠ԱҴҶüΰ∪ŨҸũУ‿⁀◡⌒◠⋓ЦЧϋŪūŬύŭŮůŰűŲųƕƯưƱƲǓǔυǕǖǗǘǙǚǛǜȔȕȖȗɄɥʉʊʋΏΩϠ"].concat(["u","o","a","e","you","yu","y","v","\\/","(_)","|_|","i_i","l_l","[_]","{_}","\\_/","(_}","{_)"]),
"v":[..."√∛∜ƔƛƲɅʋᴠˠᵧЎᵥ⍻⍱☑ᶌᵛᵞᶺﬞʌУѴ⎀⏷Ѷ˯⍗⎷⍌♈⍫⌄⎖⍢⏬ʍ⍒℣≚⌵⌔⎉√∨∛⋎∜˅⟇∀⋀⋁⸪ˇ⚺⚻ˬ˯✅∆∇￬✓✔☟ↆ⟎⟏ΔΛѪ⛛λ⛤‸⛥⛦⛧Ѭ✌ⅤⅴⅥⅦⅧ"].concat(["v","u","y","\\/","<",">","╲╱"]),
"w":[..."ŴŵƜɯɰѰԜ♒ᵂ⏙ᵜᴟﬓﬔﬕᴡﬖᵫᴪᴥﬗᶬᶭ⛲⏟Ѡѡ⟒₩⍵￦₪ա⚶⍹⍦☫⅏☬⚓ש〽ʍ⚖Шשׁשׂשּׁשּׂ♆ЩѼѾʬʷ⚜պΨωώ☘ϖϢϣשּ♨ѪѬ♕♛"].concat(["w","v","m","\\/\\/","|/\\|","\\//","\\\\/","|/\\/","\\/\\|"]),
"x":[..."×ƛˣӼӾΞ☓ℵԖᵪ⛌⛐⍀⑅Χᶍ⏧⊠⊗〤ᵡ⌿✕˟✖⌫⋈אַאָאּ⋉⋊✗⹆≭〆〷⌦⌧⸼〩✘Ҳ※〿Ԫ╳❌❎⚵ₓ☢⁕☒⚹⟕⟖⟗⛝✇⛤✡⛥⛹⛦⛧⁑☠⁎☧☪⁒%⚝⛆⚔✀✁✂✃✄ϗ⛭⛮⁂⛯⚛Ж⛒⚙♃☣☼ХԔӜҖӁ⚒ϞϟϪϰⅨⅩⅪ☆Ⅻⅸ★ⅹⅺⅻ☀"].concat(["x","><","*","z",")(","}{","]["]),
"y":[..."¥ÝýÿЎŶӴ⚚ŷᵩˠ⛲ᵧץ⑂￥ᵞℷצᴪᵠӮ⚘Ӱ⅄ӲŸℽ⁁☂⛱Ү☔☢⛹Ӌ☤☥Ҷ⚜♐ҸҰ☘УЧ☮ƔЏΫѸλƛƳƴȲȳɎɏɣɤ۩ʎʏʸϒϓϔˠΎΥγϠϤ"].concat(["y","'/","`/","uj","v/","vj","u/","7"]),
"z":[..."ŹźŻżŽžƵƶᵶȤℤ℥ȥɀʐʑᴢ☡ᶻᶼᶽᶎ˞⛽〻⛈☈⌁々Ζϟ↊☇♃⛷⛹♪⚡"].concat(["z","s","5","2","x","|\\|","|/|"]),
"0":[..."⁰₀"].concat(["0",")"]),
"1":[..."¹⅟Ⅰ♃₁〡"].concat(["1","!"]),
"2":[..."²ԶƻϨⅡﾩ₂↊♃♊₹˞〢"].concat(["2"]),
"3":[..."³ƐƷЗƸℨ⌇ᶾ∛ᴣᶚ₃ᴈѮ℥ƹƺǮ⹉〻ﾖǯｮȜ〣ȝɛ϶ɜɝʒέξℇ℈ʓ＃ϵⅢ↋"].concat(["3","#"]),
"4":[..."⁴ϤЧԿҶ₄∜ӋҸ〤Ⅳ⁴"].concat(["4"]),
"5":[..."⁵ƼƽⅤ〥⁵₅✋"].concat(["5"]),
"6":[..."⁶ϬԺⅥ〦⁶₆"].concat(["6"]),
"7":[..."⁷⅂⎲Ⅶ˹˺ﾡ◜◝⁊˥˦⌉｢┌⎲┍┎ﾡ┏┐⎡⎤⎧⌌⏋⌍⌐┑⌈⌉┒⎾「┓╒ヿךּ『⌜⌝⌠⸎⸢⸣╓╔⸀⸁⸂⸃⸄⸅╕╖╗Ի▛▜דּהּ⟔⁷₇ℸｧ〧ｱ"].concat(["7"]),
"8":[..."⁸ȢȣϨՑ₈☍ᴽ⌛ᴕ⏳₰∝∞〨Ⅷ⏦⅋&＆℔₴⁸☃⛄⛇₻⛓"].concat(["8"]),
"9":[..."⁹ϑϱԶⅨ⁹₉〩"].concat(["9"]),
"-":[..."⁻¯±·÷⛔−⋯〰˗⎓⊖🈔🈩🈪🉁ᴥ🉂˞˜✏⏦⎶⍨⏤⎯⊟⊶⊷⊸⎺⏛⎻⎼⎽⌤⌯⌥✑✒⋍⍯⌁⊜⊝˭⸚⸛∸∹∺∻∼∽∾∿⹀⁼ー➖ｰ≠≡≢≣⿱〾⸺⸻≁≂≃≄≅≆≇≈≉≊≋≌≍≎≏≐≑≒≓≔≕≖≗≘≙≚≛≜≝≞≟⠒⸞⸟┄゠ニ－〜┅=〽〦〧〨〓ﾆￚ☰☱┈⹃┉╴╶╸╺╼╾☲╌╍☴☵═☶☷─━⚊⚋⚌⚍⚎⚏‐‑‒–—―⁃⁓⁻⁼₋₌⟚⟛⟜⟝⟞"].concat(["-","_","=","~","­"]),
"+":[..."⁺±☩⛑⊞⊕˖⊹⛨÷※⁜⌖⌘⌗∓∔⁺₊⍅⍆✙➕➗✚✛✜✠✢〤x✣✤✥＋┼┽┾┿╀╁╂╃╄╅╆╇╈╉╊╋╪╫╬"].concat(["+"]),
"_":[..."¯˭⚊⚋‗▁␣‾⋕‿⎴˽˷˾ˍ⎵◡₋₌▂⸏⸐ˉ⸑▃▄▔＿￣"].concat(["_","-"]),
"!":[..."ǃ⚠‼‽⁈יִ⁉❕❗⸘！"].concat(["!","¡"]),
"?":[..."Ɂɂʔʕ⸮ʖʡʢ␦ˀˁˤ☭‽⍰⁇⁈⸘≟⁉❓❔？"].concat(["?","¿"]),
"|":[..."¦ǀǁ⋮⍿⑈⑉⋰⌇⑊⋱⑇⏽⎰⎸⎹⏐␥⎱ǂ⌿⍀҂⏀⏚♐⏆⊘‖†⋕⿰†≀⠃〸∣∤∥∦ⸯ⸠⍁⍂⸡∕∖⏸⸓⎛⎜⎝⎞⎟⎠⎡⎢⎣⎤⎥⎦⎧⎨⎩⎪⎫⎬⎭⎮⸌⸍〹⹊〺⸽⸾⸿〳〴〵⠇〼⠅〡〢〣‡ￜ┊▏￤┋▕￨│┃┆｜ﾉ┇⁁▚▞⁄⁅╎╏⁆⁒⁝⁞⟋／⟍＼⟟✎║✐❘├┝┞▌▍▎▐┟┠┡┢┣┤┥┦┧┨┩┪┫╞╟╠╡╢╣╵╷╹╻╽╿╱╲"].concat(["|"]),
"$":[..."¢£¤¥＄￠￡￥￦"].concat([]),
".":[..."¨·¸·☉｡⚀⚆⚇◬⚈⸪⸫˙˚ˑ˒˓˔˛˕˖ˌ∘⍮ˎˏ⑆⑇ː⑈⊡⑉⊙⊚∴∵⋅⍠∶∷∙⸰⸱⸲⹌⸳⸴⸵⸬⹉⸭．⚉⹁⹂、⸼。・⛚ﾟ､⸜⸝⸓，⛣⛬․゚〪〭〫〬゜〮〯‥…･‧⁖:;：；⁘⁙⁚⁛⁜⁝⁞⟓⟔▖▗▘▝⠂⠆⠁⠂"].concat([]),
"<":[..."«˂≤≺☇☈☙˿☚∠∡˱⏴⋚⋛⌫⏎∢☜⚟〱〲くぐ‹⏪⏮⟨⟪⏿❬❮❰⟬✀✁￩✂✃✄＜〈《≶≷≸≹"].concat([]),
">":[..."»˃≥≻☛☞⚞⚩⎆⎇‣˲⏵⌱⌲⌳›⟩⋚⋛⌦⍩⎖⟫❭⏩⏭⏯❯❱ゝ⸖ゞ⟭￫✈➔＞➘➙➚➛➜➝➞➟〉≶≷≸≹》➠➡➢➣➤➥➦➧➨➩➪➫➬➭➮➯➱➲➳➴➵➶➷➸➹➺➻➼➽➾"].concat([]),
"'":[..."ʹʺʻʼʽˊˋ˝˴˵˶ʾˎˏʿ⸲⸴ˈˮʹ͵ײַײ、⸒⍞⏍〃׳⍪״ⸯ⍘‘⹁⹂’‚⹄〝〞⸜⸝〟゙゛‛“”„ﾐ､＇ヽヾ＂‟′″‴‵‶‷｀‹›⁗❛❜❝❞❟❠"].concat(["'","\"","`","´",",","."]),
"square":[..."☐☑☒☖☗⚀⚁⚂⚃⚄⍁⍗⍓⎔⎕⏥⏢⏣⍔🈔🈩🈪🈚🈯🈲🈳🈴🈵🈶🈸🈹🈺⍰⍂⑆⍃⍄⍞⍇⍈⏍⍯⏛⍌⏹⍍⎗⎘⎙⎚⎅⎆⍐⚅⚼⚿⍚⊞⎎⎏⎐⎑⎒⊟⊠⊡⛉⸬⸭⛊⌬⛋￭⌷⌸⌹⌺⌻⌼⌂⌨⛖⌘⌫⟎⟏⌗⟐⋄⌑⌦⌧⛗⛘⛙⛚⛜⣿⣶⛝░ﾛ▒〼∎▓▖⸋▗ﾱ▘▙⿰⿱⿲⿳⿴⿵⿶⿷⿸⿹⿺⿻▚▛▜▝▞▟▐⟠⟡⟢✉⟣⟤⟥⛞⛨⛪⛫⛶⛾⛿❏❐❑❒❖❙❚▀▂▃▄▅▆▇█▉▊▋▌▍▎"].concat([]),
"*":[..."*∗✦✧✨✩✪✫✬✭✮✯✰✱✲✳⊛＊⋆⋇✴≛✵✶⍣✷✸✹✺✻✼⎈✽⍟✾✿❀❁❂❃❄❅❆❇❈❉❊❋"],
"heart":[..."❤❥❦❧☙"].concat(["<3","love","luv","heart","Ɛ>"]),
"":[],
"":[],
"":[],
"censor":[..."＃％"].concat(["/","*","-","_","\\","?","'","@","#","$","!","&","%"]),
"sep":[..."¯¨°¸÷ʭ•‣￮￭◦[]|+<>【】〔〕〖〗〘〙〚〛〻"].concat([]),
"invis":[...""].concat([" ","\n","\r","\t","\f","\b","\t","\v"," ","­"]),
}
charranges = {
"o":"\u25A0-\u25FF",
"d":"\u25B2-\u25C8◢-◥◬-◮◸-◺",
}
charranges["a"] = charranges["o"]
charranges["e"] = charranges["o"]
charranges["i"] = charranges["o"]
charranges["u"] = charranges["o"]

function mapchars(charmap,charmaps) {
    try {
    for (var i in charmaps) {
        var chars = [...charmaps[i]];
        for (i2 in chars) {
            var char = chars[i2];
            characters[charmap[i2]].push(char);
        }
    }
    }
    catch {console.log(chars[i2])}
}
mapchars("abcdefghijklmnopqrstuvwxyz",[
    "⒜⒝⒞⒟⒠⒡⒢⒣⒤⒥⒦⒧⒨⒩⒪⒫⒬⒭⒮⒯⒰⒱⒲⒳⒴⒵",
    "ⒶⒷⒸⒹⒺⒻⒼⒽⒾⒿⓀⓁⓂⓃⓄⓅⓆⓇⓈⓉⓊⓋⓌⓍⓎⓏ",
    "ⓐⓑⓒⓓⓔⓕⓖⓗⓘⓙⓚⓛⓜⓝⓞⓟⓠⓡⓢⓣⓤⓥⓦⓧⓨⓩ",
    "𝐀𝐁𝐂𝐃𝐄𝐅𝐆𝐇𝐈𝐉𝐊𝐋𝐌𝐍𝐎𝐏𝐐𝐑𝐒𝐓𝐔𝐕𝐖𝐗𝐘𝐙",
    "𝐚𝐛𝐜𝐝𝐞𝐟𝐠𝐡𝐢𝐣𝐤𝐥𝐦𝐧𝐨𝐩𝐪𝐫𝐬𝐭𝐮𝐯𝐰𝐱𝐲𝐳",
    "𝐴𝐵𝐶𝐷𝐸𝐹𝐺𝐻𝐼𝐽𝐾𝐿𝑀𝑁𝑂𝑃𝑄𝑅𝑆𝑇𝑈𝑉𝑊𝑋𝑌𝑍",
    "𝑎𝑏𝑐𝑑𝑒𝑓𝑔h𝑖𝑗𝑘𝑙𝑚𝑛𝑜𝑝𝑞𝑟𝑠𝑡𝑢𝑣𝑤𝑥𝑦𝑧",
    "𝑨𝑩𝑪𝑫𝑬𝑭𝑮𝑯𝑰𝑱𝑲𝑳𝑴𝑵𝑶𝑷𝑸𝑹𝑺𝑻𝑼𝑽𝑾𝑿𝒀𝒁",
    "𝒂𝒃𝒄𝒅𝒆𝒇𝒈𝒉𝒊𝒋𝒌𝒍𝒎𝒏𝒐𝒑𝒒𝒓𝒔𝒕𝒖𝒗𝒘𝒙𝒚𝒛",
    "𝒜b𝒞𝒟ef𝒢hi𝒥𝒦lm𝒩𝒪𝒫𝒬r𝒮𝒯𝒰𝒱𝒲𝒳𝒴𝒵",
    "𝒶𝒷𝒸𝒹e𝒻g𝒽𝒾𝒿𝓀𝓁𝓂𝓃o𝓅𝓆𝓇𝓈𝓉𝓊𝓋𝓌𝓍𝓎𝓏",
    "𝓐𝓑𝓒𝓓𝓔𝓕𝓖𝓗𝓘𝓙𝓚𝓛𝓜𝓝𝓞𝓟𝓠𝓡𝓢𝓣𝓤𝓥𝓦𝓧𝓨𝓩",
    "𝓪𝓫𝓬𝓭𝓮𝓯𝓰𝓱𝓲𝓳𝓴𝓵𝓶𝓷𝓸𝓹𝓺𝓻𝓼𝓽𝓾𝓿𝔀𝔁𝔂𝔃",
    "𝔄𝔅c𝔇𝔈𝔉𝔊hi𝔍𝔎𝔏𝔐𝔑𝔒𝔓𝔔r𝔖𝔗𝔘𝔙𝔚𝔛𝔜z",
    "𝔞𝔟𝔠𝔡𝔢𝔣𝔤𝔥𝔦𝔧𝔨𝔩𝔪𝔫𝔬𝔭𝔮𝔯𝔰𝔱𝔲𝔳𝔴𝔵𝔶𝔷",
    "𝔸𝔹c𝔻𝔼𝔽𝔾h𝕀𝕁𝕂𝕃𝕄n𝕆pqr𝕊𝕋𝕌𝕍𝕎𝕏𝕐z",
    "𝕒𝕓𝕔𝕕𝕖𝕗𝕘𝕙𝕚𝕛𝕜𝕝𝕞𝕟𝕠𝕡𝕢𝕣𝕤𝕥𝕦𝕧𝕨𝕩𝕪𝕫",
    "𝕬𝕭𝕮𝕯𝕰𝕱𝕲𝕳𝕴𝕵𝕶𝕷𝕸𝕹𝕺𝕻𝕼𝕽𝕾𝕿𝖀𝖁𝖂𝖃𝖄𝖅",
    "𝖆𝖇𝖈𝖉𝖊𝖋𝖌𝖍𝖎𝖏𝖐𝖑𝖒𝖓𝖔𝖕𝖖𝖗𝖘𝖙𝖚𝖛𝖜𝖝𝖞𝖟",
    "𝖠𝖡𝖢𝖣𝖤𝖥𝖦𝖧𝖨𝖩𝖪𝖫𝖬𝖭𝖮𝖯𝖰𝖱𝖲𝖳𝖴𝖵𝖶𝖷𝖸𝖹",
    "𝖺𝖻𝖼𝖽𝖾𝖿𝗀𝗁𝗂𝗃𝗄𝗅𝗆𝗇𝗈𝗉𝗊𝗋𝗌𝗍𝗎𝗏𝗐𝗑𝗒𝗓",
    "𝗔𝗕𝗖𝗗𝗘𝗙𝗚𝗛𝗜𝗝𝗞𝗟𝗠𝗡𝗢𝗣𝗤𝗥𝗦𝗧𝗨𝗩𝗪𝗫𝗬𝗭",
    "𝗮𝗯𝗰𝗱𝗲𝗳𝗴𝗵𝗶𝗷𝗸𝗹𝗺𝗻𝗼𝗽𝗾𝗿𝘀𝘁𝘂𝘃𝘄𝘅𝘆𝘇",
    "𝘈𝘉𝘊𝘋𝘌𝘍𝘎𝘏𝘐𝘑𝘒𝘓𝘔𝘕𝘖𝘗𝘘𝘙𝘚𝘛𝘜𝘝𝘞𝘟𝘠𝘡",
    "𝘢𝘣𝘤𝘥𝘦𝘧𝘨𝘩𝘪𝘫𝘬𝘭𝘮𝘯𝘰𝘱𝘲𝘳𝘴𝘵𝘶𝘷𝘸𝘹𝘺𝘻",
    "𝘼𝘽𝘾𝘿𝙀𝙁𝙂𝙃𝙄𝙅𝙆𝙇𝙈𝙉𝙊𝙋𝙌𝙍𝙎𝙏𝙐𝙑𝙒𝙓𝙔𝙕",
    "𝙖𝙗𝙘𝙙𝙚𝙛𝙜𝙝𝙞𝙟𝙠𝙡𝙢𝙣𝙤𝙥𝙦𝙧𝙨𝙩𝙪𝙫𝙬𝙭𝙮𝙯",
    "𝙰𝙱𝙲𝙳𝙴𝙵𝙶𝙷𝙸𝙹𝙺𝙻𝙼𝙽𝙾𝙿𝚀𝚁𝚂𝚃𝚄𝚅𝚆𝚇𝚈𝚉",
    "𝚊𝚋𝚌𝚍𝚎𝚏𝚐𝚑𝚒𝚓𝚔𝚕𝚖𝚗𝚘𝚙𝚚𝚛𝚜𝚝𝚞𝚟𝚠𝚡𝚢𝚣",
    "ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ",
    "ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ",
    "⠁⠃⠉⠙⠑⠋⠛⠓⠊⠚⠅⠇⠍⠝⠕⠏⠟⠗⠎⠞⠥⠧⠺⠭⠽⠵",
    "卂乃匚ᗪ乇千Ꮆ卄丨ﾌҜㄥ爪几ㄖ卩Ɋ尺丂ㄒㄩᐯ山乂ㄚ乙",
    "🄐🄑🄒🄓🄔🄕🄖🄗🄘🄙🄚🄛🄜🄝🄞🄟🄠🄡🄢🄣🄤🄥🄦🄧🄨🄩",
    "🄰🄱🄲🄳🄴🄵🄶🄷🄸🄹🄺🄻🄼🄽🄾🄿🅀🅁🅂🅃🅄🅅🅆🅇🅈🅉",
    "🅐🅑🅒🅓🅔🅕🅖🅗🅘🅙🅚🅛🅜🅝🅞🅟🅠🅡🅢🅣🅤🅥🅦🅧🅨🅩",
    "🅰🅱🅲🅳🅴🅵🅶🅷🅸🅹🅺🅻🅼🅽🅾🅿🆀🆁🆂🆃🆄🆅🆆🆇🆈🆉",
    "🇦🇧🇨🇩🇪🇫🇬🇭🇮🇯🇰🇱🇲🇳🇴🇵🇶🇷🇸🇹🇺🇻🇼🇽🇾🇿",
])
mapchars("0123456789",[
    "⓪①②③④⑤⑥⑦⑧⑨",
    "🄋➀➁➂➃➄➅➆➇➈",
    "⓿➊➋➌➍➎➏➐➑➒",
    "🄌❶❷❸❹❺❻❼❽❾",
    "𝟎𝟏𝟐𝟑𝟒𝟓𝟔𝟕𝟖𝟗",
    "𝟘𝟙𝟚𝟛𝟜𝟝𝟞𝟟𝟠𝟡","𝟢𝟣𝟤𝟥𝟦𝟧𝟨𝟩𝟪𝟫","𝟬𝟭𝟮𝟯𝟰𝟱𝟲𝟳𝟴𝟵","𝟶𝟷𝟸𝟹𝟺𝟻𝟼𝟽𝟾𝟿",
    "０１２３４５６７８９",
    "🄀⒈⒉⒊⒋⒌⒍⒎⒏⒐",
    "⠚⠁⠃⠉⠙⠑⠋⠛⠓⠊",
    "🄁🄂🄃🄄🄅🄆🄇🄈🄉🄊",
])
mapchars("123456789",[
    "⑴⑵⑶⑷⑸⑹⑺⑻⑼",
    "⓵⓶⓷⓸⓹⓺⓻⓼⓽",

])
mapchars("1234567",["♳♴♵♶♷♸♹"])
/*greek*/mapchars("abraezhoikamneonpoetyoxwov",[
    "𝚨𝚩𝚪𝚫𝚬𝚭𝚮𝚯𝚰𝚱𝚲𝚳𝚴𝚵𝚶𝚷𝚸𝚹𝚺𝚻𝚼𝚽𝚾𝚿𝛀𝛁",
    "𝛢𝛣𝛤𝛥𝛦𝛧𝛨𝛩𝛪𝛫𝛬𝛭𝛮𝛯𝛰𝛱𝛲𝛳𝛴𝛵𝛶𝛷𝛸𝛹𝛺𝛻",
    "𝜜𝜝𝜞𝜟𝜠𝜡𝜢𝜣𝜤𝜥𝜦𝜧𝜨𝜩𝜪𝜫𝜬𝜭𝜮𝜯𝜰𝜱𝜲𝜳𝜴𝜵",
    "𝝖𝝗𝝘𝝙𝝚𝝛𝝜𝝝𝝞𝝟𝝠𝝡𝝢𝝣𝝤𝝥𝝦𝝧𝝨𝝩𝝪𝝫𝝬𝝭𝝮𝝯",
    "𝞐𝞑𝞒𝞓𝞔𝞕𝞖𝞗𝞘𝞙𝞚𝞛𝞜𝞝𝞞𝞟𝞠𝞡𝞢𝞣𝞤𝞥𝞦𝞧𝞨𝞩",

])
/*greek*/mapchars("abydesnoikauv3onpsotuyxwwde9xopw",[
    "𝛂𝛃𝛄𝛅𝛆𝛇𝛈𝛉𝛊𝛋𝛌𝛍𝛎𝛏𝛐𝛑𝛒𝛓𝛔𝛕𝛖𝛗𝛘𝛙𝛚𝛛𝛜𝛝𝛞𝛟𝛠𝛡",
    "𝛼𝛽𝛾𝛿𝜀𝜁𝜂𝜃𝜄𝜅𝜆𝜇𝜈𝜉𝜊𝜋𝜌𝜍𝜎𝜏𝜐𝜑𝜒𝜓𝜔𝜕𝜖𝜗𝜘𝜙𝜚𝜛",
    "𝜶𝜷𝜸𝜹𝜺𝜻𝜼𝜽𝜾𝜿𝝀𝝁𝝂𝝃𝝄𝝅𝝆𝝇𝝈𝝉𝝊𝝋𝝌𝝍𝝎𝝏𝝐𝝑𝝒𝝓𝝔𝝕",
    "𝝰𝝱𝝲𝝳𝝴𝝵𝝶𝝷𝝸𝝹𝝺𝝻𝝼𝝽𝝾𝝿𝞀𝞁𝞂𝞃𝞄𝞅𝞆𝞇𝞈𝞉𝞊𝞋𝞌𝞍𝞎𝞏",
    "𝞪𝞫𝞬𝞭𝞮𝞯𝞰𝞱𝞲𝞳𝞴𝞵𝞶𝞷𝞸𝞹𝞺𝞻𝞼𝞽𝞾𝞿𝟀𝟁𝟂𝟃𝟄𝟅𝟆𝟇𝟈𝟉"
])
mapchars("<><><><><><><><><><><><><><><><><><><><><><><><><><><>",[
    "≤≥≦≧≨≩≪≫≮≯≰≱≲≳≴≵≺≻≼≽≾≿⊀⊁⊰⊱⊲⊳⊴⊵⋖⋗⋘⋙⋜⋝⋞⋟⋠⋡⋦⋧⋨⋩⋪⋫⋬⋭〈〉⍃⍄⍇⍈"
])


letters = {
    "␡":"del","¼":"14","½":"12","¾":"34","Ĳ":"ij","ĳ":"ij","Œ":"oe","oe":"œ","ƕ":"hv","Ǆ":"dz","ǅ":"dz","ǆ":"dz","Ǉ":"lj","ǈ":"lj","ǉ":"lj","Ǌ":"nj","ǋ":"nj","ǌ":"nj","Ǳ":"dz","ǲ":"dz","ǳ":"dz","ȸ":"db","ȹ":"qp","ɮ":"l3","ɶ":"oe","ʣ":"dz","ʤ":"d3","ʥ":"dz","ʦ":"ts","ʧ":"tf","ʨ":"tc","ʩ":"fn","ʪ":"ls","ʫ":"lz","ʬ":"ww","Ы":"bl","Ю":"io","⅐":"17","⅑":"19","⅒":"110","⅓":"13","⅔":"23","⅕":"15","⅖":"25","⅗":"35","⅘":"45","⅙":"16","⅚":"56","⅛":"18","⅜":"38","⅝":"58","⅞":"78","↉":"03","⑩":"10","⑪":"11","⑫":"12","⑬":"13","⑭":"14","⑮":"15","⑯":"16","⑰":"17","⑱":"18","⑲":"19","⑳":"20","⑽":"10","⑾":"11","⑿":"12","⒀":"13","⒁":"14","⒂":"15","⒃":"16","⒄":"17","⒅":"18","⒆":"19","⒇":"20","⒑":"10","⒒":"11","⒓":"12","⒔":"13","⒕":"14","⒖":"15","⒗":"16","⒘":"17","⒙":"18","⒚":"19","⒛":"20","⓫":"11","⓬":"12","⓭":"13","⓮":"14","⓯":"15","⓰":"16","⓱":"17","⓲":"18","⓳":"19","⓴":"20","⓾":"10","❿":"10","➓":"10","➉":"10",
    "₧":"pts","₠":"ce","₨":"rs","₯":"dp","℀":"ac","℁":"as","℅":"co","℆":"cu","℄":"cl","℔":"lb","№":"no","℠":"sm","℡":"tel","™":"tm","℻":"fax","⅍":"as","≝":"def","⏨":"10","␀":"nul","␁":"soh","␂":"stx","␃":"etx","␄":"eot","␅":"enq","␆":"ack","␇":"bel","␈":"bs","␉":"ht","␊":"lf","␋":"vt","␌":"ff","␍":"cr","␎":"so","␏":"si","␐":"dle","␑":"dc1","␒":"dc2","␓":"dc3","␔":"dc4","␕":"nak","␖":"syn","␗":"etb","␘":"can","␙":"em","␚":"sub","␛":"esc","␜":"fs","␝":"gs","␞":"rs","␟":"us","␠":"sp","␡":"del","␤":"nl","ﬀ":"ff",
    "ﬁ":"fi",
    "ﬂ":"fl",
    "ﬃ":"ffi",
    "ﬄ":"ffl",
    "ﬅ":"ft",
    "ﬆ":"st",
    "🄭":"cd",
    "🄮":"wz",
    "🅊":"hv",
    "🅋":"mv",
    "🅌":"sd",
    "🅍":"ss",
    "🅎":"ppv",
    "🅏":"wc",
    "🅪":"mc",
    "🅫":"md",
    "🅬":"mr",
    "🅭":"cc",
    "🆋":"ic",
    "🆌":"pa",
    "🆍":"sa",
    "🆎":"ab",
    "🆏":"wc",
    "🆐":"dj",
    "🆑":"cl",
    "🆒":"cool",
    "🆓":"free",
    "🆔":"id",
    "🆕":"new",
    "🆖":"ng",
    "🆗":"ok",
    "🆘":"sos",
    "🆙":"up",
    "🆚":"vs",
    "🆛":"3d",
    "🆜":"2ndscr",
    "🆝":"2k",
    "🆞":"4k",
    "🆟":"8k",
    "🆠":"51",
    "🆡":"71",
    "🆢":"222",
    "🆣":"60p",
    "🆤":"120p",
    "🆦":"hc",
    "🆧":"hdr",
    "🆨":"hires",
    "🆩":"lossless",
    "🆪":"shv",
    "🆫":"uhd",
    "🆬":"vod",
    "🈁":"cc",
    "ᵺ":"th",
    "":"",
    "":"",
    "":"",
    "":"",
    "":"",
    "":"",
    "":"",
    "":"",
    "":"",
    "":"",
    "":"",
    "":"",
    "":"",
    "":"",
    "":"",
    "":"",
    
    

}

function mergechars(x,y) {
    var newlist = characters[x].concat(characters[y]);
    characters[x] = newlist;
    characters[y] = newlist;
}
function combinedchars(...l) {
    newlist = [];
    for (var i in l) {
        newlist = newlist.concat(characters[l[i]])
    }
    return newlist
}
characters["punc"] = combinedchars("!","?",".","'","-","_",">","<");
mergechars("c","k");
mergechars("i","l");
mergechars("i","j");
mergechars("s","z");
mergechars("i","1");
mergechars("l","1");
mergechars("i","|");
mergechars("l","|");
mergechars("j","1");
mergechars("o","0");
mergechars("s","2");
mergechars("s","5");
mergechars("e","3");
mergechars("a","4");
mergechars("b","8");
mergechars("t","7");
mergechars("y","7");
mergechars("g","6");
mergechars("g","9");
mergechars("6","9");
mergechars("!","i");
mergechars("!","l");
mergechars("!","|");
mergechars("!","j");
mergechars("!","1");
mergechars("a","o");
mergechars("a","e");
mergechars("-","_");
mergechars("7","l");
mergechars("h","n");
mergechars("c","<");
mergechars("c",">");
mergechars("+","t");
mergechars("u","v");
characters['"'] = characters["'"];
characters['/'] = characters["|"];
characters['\\'] = characters["|"];
characters['['] = characters["c"];
characters[']'] = characters["c"];
characters['('] = characters["c"];
characters[')'] = characters["c"];
characters['{'] = characters["c"];
characters['}'] = characters["c"];
characters['='] = characters["-"];
characters['^'] = characters["a"];
characters["censor"] = combinedchars("censor","*");
mergechars("x","*");
characters["sep"] = combinedchars("sep","invis","punc");
characters["o"] = combinedchars("o","square","heart","*");
characters[" "] = characters["invis"];
//characters["sep"] = characters["sep"].concat(characters["invis"]).concat(characters["'"]);

newchars = {};
for (key in characters) {
    newchars[key] = [...new Set(characters[key].concat(characters["censor"]).map(function(v) {
        try {return v.toLowerCase();}
        catch {return v}
      })
    )];
}
characters = newchars;